zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA175/startup_MCXA175.cpp
//*****************************************************************************
// MCXA175 startup code
//
// Version : 090226
//*****************************************************************************
//
// Copyright 2016-2026 NXP
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************
#include <stdint.h>

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC push_options
#pragma GCC optimize("Og")
#endif //(__GNUC__)
#endif //(DEBUG)

#if defined(__cplusplus)
#if defined(__MCUXPRESSO)
#if defined(__REDLIB__)
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
extern void __libc_init_array(void);
}
#endif //(__REDLIB__)
#endif //(__MCUXPRESSO)
#endif //(__cplusplus)

#define WEAK __attribute__((weak))
#if defined(__MCUXPRESSO)
#define WEAK_AV __attribute__((weak, section(".after_vectors")))
#else
#define WEAK_AV __attribute__((weak))
#endif //(__MCUXPRESSO)
#define ALIAS(f) __attribute__((weak, alias(#f)))

//*****************************************************************************
#if defined(__cplusplus)
extern "C" {
#endif //(__cplusplus)

//*****************************************************************************
// Variable to store CRP value in. Will be placed automatically
// by the linker when "Enable Code Read Protect" selected.
// See crp.h header for more information
//*****************************************************************************
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
extern void SystemInit(void);

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
#if defined(__MCUXPRESSO)
void ResetISR(void);
#else
void Reset_Handler(void);
#endif //(__MCUXPRESSO)
void Reset_Handler_C(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SecureFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void DefaultISR(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void Reserved16_IRQHandler(void);
WEAK void CMC_IRQHandler(void);
WEAK void DMA_CH0_IRQHandler(void);
WEAK void DMA_CH1_IRQHandler(void);
WEAK void DMA_CH2_IRQHandler(void);
WEAK void DMA_CH3_IRQHandler(void);
WEAK void DMA_CH4_IRQHandler(void);
WEAK void DMA_CH5_IRQHandler(void);
WEAK void DMA_CH6_IRQHandler(void);
WEAK void DMA_CH7_IRQHandler(void);
WEAK void ERM0_SINGLE_BIT_IRQHandler(void);
WEAK void ERM0_MULTI_BIT_IRQHandler(void);
WEAK void FMU0_IRQHandler(void);
WEAK void GLIKEY0_IRQHandler(void);
WEAK void MBC0_IRQHandler(void);
WEAK void SCG0_IRQHandler(void);
WEAK void SPC0_IRQHandler(void);
WEAK void TDET_IRQHandler(void);
WEAK void WUU0_IRQHandler(void);
WEAK void CAN0_IRQHandler(void);
WEAK void Reserved36_IRQHandler(void);
WEAK void Reserved37_IRQHandler(void);
WEAK void Reserved38_IRQHandler(void);
WEAK void FLEXIO_IRQHandler(void);
WEAK void I3C0_IRQHandler(void);
WEAK void Reserved41_IRQHandler(void);
WEAK void LPI2C0_IRQHandler(void);
WEAK void LPI2C1_IRQHandler(void);
WEAK void LPSPI0_IRQHandler(void);
WEAK void LPSPI1_IRQHandler(void);
WEAK void Reserved46_IRQHandler(void);
WEAK void LPUART0_IRQHandler(void);
WEAK void LPUART1_IRQHandler(void);
WEAK void LPUART2_IRQHandler(void);
WEAK void LPUART3_IRQHandler(void);
WEAK void LPUART4_IRQHandler(void);
WEAK void USB0_IRQHandler(void);
WEAK void Reserved53_IRQHandler(void);
WEAK void CDOG0_IRQHandler(void);
WEAK void CTIMER0_IRQHandler(void);
WEAK void CTIMER1_IRQHandler(void);
WEAK void CTIMER2_IRQHandler(void);
WEAK void CTIMER3_IRQHandler(void);
WEAK void CTIMER4_IRQHandler(void);
WEAK void FLEXPWM0_RELOAD_ERROR_IRQHandler(void);
WEAK void FLEXPWM0_FAULT_IRQHandler(void);
WEAK void FLEXPWM0_SUBMODULE0_IRQHandler(void);
WEAK void FLEXPWM0_SUBMODULE1_IRQHandler(void);
WEAK void FLEXPWM0_SUBMODULE2_IRQHandler(void);
WEAK void FLEXPWM0_SUBMODULE3_IRQHandler(void);
WEAK void EQDC0_COMPARE_IRQHandler(void);
WEAK void EQDC0_HOME_IRQHandler(void);
WEAK void EQDC0_WATCHDOG_IRQHandler(void);
WEAK void EQDC0_INDEX_IRQHandler(void);
WEAK void FREQME0_IRQHandler(void);
WEAK void LPTMR0_IRQHandler(void);
WEAK void Reserved72_IRQHandler(void);
WEAK void OS_EVENT_IRQHandler(void);
WEAK void WAKETIMER0_IRQHandler(void);
WEAK void UTICK0_IRQHandler(void);
WEAK void WWDT0_IRQHandler(void);
WEAK void Reserved77_IRQHandler(void);
WEAK void ADC0_IRQHandler(void);
WEAK void ADC1_IRQHandler(void);
WEAK void CMP0_IRQHandler(void);
WEAK void CMP1_IRQHandler(void);
WEAK void Reserved82_IRQHandler(void);
WEAK void DAC0_IRQHandler(void);
WEAK void Reserved84_IRQHandler(void);
WEAK void Reserved85_IRQHandler(void);
WEAK void Reserved86_IRQHandler(void);
WEAK void GPIO0_IRQHandler(void);
WEAK void GPIO1_IRQHandler(void);
WEAK void GPIO2_IRQHandler(void);
WEAK void GPIO3_IRQHandler(void);
WEAK void GPIO4_IRQHandler(void);
WEAK void Reserved92_IRQHandler(void);
WEAK void LPI2C2_IRQHandler(void);
WEAK void LPI2C3_IRQHandler(void);
WEAK void FLEXPWM1_RELOAD_ERROR_IRQHandler(void);
WEAK void FLEXPWM1_FAULT_IRQHandler(void);
WEAK void FLEXPWM1_SUBMODULE0_IRQHandler(void);
WEAK void FLEXPWM1_SUBMODULE1_IRQHandler(void);
WEAK void FLEXPWM1_SUBMODULE2_IRQHandler(void);
WEAK void FLEXPWM1_SUBMODULE3_IRQHandler(void);
WEAK void EQDC1_COMPARE_IRQHandler(void);
WEAK void EQDC1_HOME_IRQHandler(void);
WEAK void EQDC1_WATCHDOG_IRQHandler(void);
WEAK void EQDC1_INDEX_IRQHandler(void);
WEAK void Reserved105_IRQHandler(void);
WEAK void Reserved106_IRQHandler(void);
WEAK void Reserved107_IRQHandler(void);
WEAK void Reserved108_IRQHandler(void);
WEAK void Reserved109_IRQHandler(void);
WEAK void Reserved110_IRQHandler(void);
WEAK void Reserved111_IRQHandler(void);
WEAK void Reserved112_IRQHandler(void);
WEAK void Reserved113_IRQHandler(void);
WEAK void Reserved114_IRQHandler(void);
WEAK void Reserved115_IRQHandler(void);
WEAK void Reserved116_IRQHandler(void);
WEAK void Reserved117_IRQHandler(void);
WEAK void Reserved118_IRQHandler(void);
WEAK void Reserved119_IRQHandler(void);
WEAK void Reserved120_IRQHandler(void);
WEAK void Reserved121_IRQHandler(void);
WEAK void Reserved122_IRQHandler(void);
WEAK void MAU_IRQHandler(void);
WEAK void SMARTDMA_IRQHandler(void);
WEAK void CDOG1_IRQHandler(void);
WEAK void Reserved126_IRQHandler(void);
WEAK void Reserved127_IRQHandler(void);
WEAK void Reserved128_IRQHandler(void);
WEAK void Reserved129_IRQHandler(void);
WEAK void Reserved130_IRQHandler(void);
WEAK void Reserved131_IRQHandler(void);
WEAK void Reserved132_IRQHandler(void);
WEAK void Reserved133_IRQHandler(void);
WEAK void Reserved134_IRQHandler(void);
WEAK void RTC_IRQHandler(void);
WEAK void RTC_1HZ_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the DefaultISR, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void Reserved16_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMC_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA_CH0_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA_CH1_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA_CH2_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA_CH3_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA_CH4_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA_CH5_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA_CH6_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA_CH7_DriverIRQHandler(void) ALIAS(DefaultISR);
void ERM0_SINGLE_BIT_DriverIRQHandler(void) ALIAS(DefaultISR);
void ERM0_MULTI_BIT_DriverIRQHandler(void) ALIAS(DefaultISR);
void FMU0_DriverIRQHandler(void) ALIAS(DefaultISR);
void GLIKEY0_DriverIRQHandler(void) ALIAS(DefaultISR);
void MBC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SCG0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SPC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void TDET_DriverIRQHandler(void) ALIAS(DefaultISR);
void WUU0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CAN0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved36_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved37_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved38_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXIO_DriverIRQHandler(void) ALIAS(DefaultISR);
void I3C0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved41_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C1_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved46_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART1_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART2_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART3_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART4_DriverIRQHandler(void) ALIAS(DefaultISR);
void USB0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved53_DriverIRQHandler(void) ALIAS(DefaultISR);
void CDOG0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER1_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER2_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER3_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER4_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM0_RELOAD_ERROR_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM0_FAULT_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM0_SUBMODULE0_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM0_SUBMODULE1_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM0_SUBMODULE2_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM0_SUBMODULE3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EQDC0_COMPARE_DriverIRQHandler(void) ALIAS(DefaultISR);
void EQDC0_HOME_DriverIRQHandler(void) ALIAS(DefaultISR);
void EQDC0_WATCHDOG_DriverIRQHandler(void) ALIAS(DefaultISR);
void EQDC0_INDEX_DriverIRQHandler(void) ALIAS(DefaultISR);
void FREQME0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPTMR0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved72_DriverIRQHandler(void) ALIAS(DefaultISR);
void OS_EVENT_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKETIMER0_DriverIRQHandler(void) ALIAS(DefaultISR);
void UTICK0_DriverIRQHandler(void) ALIAS(DefaultISR);
void WWDT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved77_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC1_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMP0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMP1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved82_DriverIRQHandler(void) ALIAS(DefaultISR);
void DAC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved84_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved85_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved86_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO0_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO1_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO2_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO3_DriverIRQHandler(void) ALIAS(DefaultISR);
void GPIO4_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved92_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C2_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C3_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM1_RELOAD_ERROR_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM1_FAULT_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM1_SUBMODULE0_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM1_SUBMODULE1_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM1_SUBMODULE2_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXPWM1_SUBMODULE3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EQDC1_COMPARE_DriverIRQHandler(void) ALIAS(DefaultISR);
void EQDC1_HOME_DriverIRQHandler(void) ALIAS(DefaultISR);
void EQDC1_WATCHDOG_DriverIRQHandler(void) ALIAS(DefaultISR);
void EQDC1_INDEX_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved105_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved106_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved107_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved108_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved109_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved110_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved111_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved112_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved113_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved114_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved115_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved116_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved117_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved118_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved119_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved120_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved121_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved122_DriverIRQHandler(void) ALIAS(DefaultISR);
void MAU_DriverIRQHandler(void) ALIAS(DefaultISR);
void SMARTDMA_DriverIRQHandler(void) ALIAS(DefaultISR);
void CDOG1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved126_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved127_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved128_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved129_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved130_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved131_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved132_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved133_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved134_DriverIRQHandler(void) ALIAS(DefaultISR);
void RTC_DriverIRQHandler(void) ALIAS(DefaultISR);
void RTC_1HZ_DriverIRQHandler(void) ALIAS(DefaultISR);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void __main(void);
#elif defined(__MCUXPRESSO)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern int main(void);
#endif //(__REDLIB__)
#elif defined(__ICCARM__)
extern void __iar_program_start(void);
#elif defined(__GNUC__)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern void _start(void);
#endif //(__REDLIB__)
#else
#error Unsupported toolchain!
#endif //(__MCUXPRESSO)

//*****************************************************************************
// External declaration for the pointer from the Linker Script
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Base[];
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Limit[];
#define _vStackTop  Image$$ARM_LIB_STACK$$ZI$$Limit
#define _vStackBase Image$$ARM_LIB_STACK$$ZI$$Base
#elif defined(__MCUXPRESSO)
extern void _vStackTop(void);
extern void _vStackBase(void);
#define Reset_Handler ResetISR // To be compatible with other compilers
#elif defined(__ICCARM__)
#pragma segment = "CSTACK"
#define _vStackTop  __section_end("CSTACK")
#define _vStackBase __section_begin("CSTACK")
#elif defined(__GNUC__)
extern uint32_t __StackTop[];
extern uint32_t __StackLimit[];

